Revit 2027 API
BuiltInFailures.RebarSystemFailures.HostFlagAreaOn Property
 The Area Reinforcement element was created in a document with the Host Structural Rebar setting on, and cannot be transferred into this document, which has the setting off.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HostFlagAreaOn { get; }
Public Shared ReadOnly Property HostFlagAreaOn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HostFlagAreaOn {
	FailureDefinitionId^ get ();
}
static member HostFlagAreaOn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace